title: Detect T1046.4 - Python Portscan
id: 4ad74d01-f48c-42d0-b88c-b31efa4d2262
status: test
description: Detects T1046.4 - Python Portscan
author: Justin Chin
date: 2025-06-14
modified: 2025-06-14
tags:
    - attack.execution
    - detection.threat-hunting
    - mitre.T1046.4
logsource:
    product: windows
    category: process_creation
detection:
    selection_01:
        - Image|endswith:
              - '\powershell.exe'
              - '\pwsh.exe'
        - OriginalFileName:
              - 'PowerShell.EXE'
              - 'pwsh.dll'
    selection_02:
        CommandLine|contains:
            - 'T1046.py'
            - 'C:\AtomicRedTeam\atomics\'
    condition: all of selection_* 
falsepositives:
    - Unknown
level: low
