title: Detect Impair Defenses (powershell)
id: 4ad74d01-f48c-42d0-b88c-b31efa4d2262
status: test
description: Tamper with Windows Defender ATP PowerShell
author: Justin Chin
date: 2025-06-16
modified: 2025-06-16
tags:
    - attack.defense-evasion
    - detection.threat-hunting
    - attack.T1562.001
logsource:
    product: windows
    category: process_creation
detection:
    selection_image:
        - Image|endswith:
              - '\powershell.exe'
              - '\pwsh.exe'
        - OriginalFileName:
              - 'PowerShell.EXE'
              - 'pwsh.dll'
    selection_cmdline:
        - CommandLine|contains:
              - 'Set-MpPreference -DisableRealtimeMonitoring 1'
              - 'Set-MpPreference -DisableBehaviorMonitoring 1'
              - 'Set-MpPreference -DisableScriptScanning 1'
              - 'Set-MpPreference -DisableBlockAtFirstSeen 1' 
    condition: all of selection_*
falsepositives:
    - Unlikely
level: High
